In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\drnim\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\drnim\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\drnim\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\drnim\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\drnim\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\drnim\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
print(pd.__version__)

2.2.2

In [5]:
import numpy as np
import pandas as pd
a=np.array([1,2,3])
b=pd.Series(a)
print(b)

0    1
1    2
2    3
dtype: int32

In [11]:
# List to Series
a=[1,2,3,4,5,6]
b=pd.Series(a)
print(b)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [15]:
# indexing
print(b[0])
print(b[3])

1
4

In [21]:
a=pd.Series([1,2,3,4],index=['a','b','c','d'])
print(a)

a    1
b    2
c    3
d    4
dtype: int64

In [24]:
# dictionary to series
a={"day1":400,"day2":234,"day3":2341}
b=pd.Series(a)
print(b)

day1     400
day2     234
day3    2341
dtype: int64

In [26]:
a=pd.Series({"day1":400,"day2":234,"day3":2341})
print(a)

day1     400
day2     234
day3    2341
dtype: int64

In [28]:
# DataFrame
data={"rollno":[1,2,3,4,5],"age":[25,35,24,33,21]}
df=pd.DataFrame(data)
print(df)

   rollno  age
0       1   25
1       2   35
2       3   24
3       4   33
4       5   21

In [30]:
print(df.loc[0])

rollno     1
age       25
Name: 0, dtype: int64

In [34]:
print(df.loc[[0, 1]])

   rollno  age
0       1   25
1       2   35

In [37]:
data={"rollno":[1,2,3,4,5],"age":[25,35,24,33,21]}
df=pd.DataFrame(data,index=['A','B','C','D','E'])
print(df)

   rollno  age
A       1   25
B       2   35
C       3   24
D       4   33
E       5   21

In [41]:
print(df.loc['A'])

rollno     1
age       25
Name: A, dtype: int64

In [45]:
# read csv file
a=pd.read_csv('dataset/salaries.csv')
print(a)

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

In [56]:
# skip the rows
a=pd.read_csv('dataset/salaries.csv',skiprows=10)
print(a)

  abc pharma     business manager    masters  1
0   facebook      sales executive  bachelors  1
1   facebook      sales executive    masters  1
2   facebook     business manager  bachelors  1
3   facebook     business manager    masters  1
4   facebook  computer programmer  bachelors  1
5   facebook  computer programmer    masters  1

In [70]:
# to show the header
a=pd.read_csv('dataset/salaries.csv',header=0)
a

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

In [82]:
# Load the CSV file with custom headers
a=pd.read_csv('dataset/salaries.csv',header=None,names=['company_name','Designation','Education','Income'])
a

   company_name          Designation  Education                 Income
0       company                  job     degree  salary_more_then_100k
1        google      sales executive  bachelors                      0
2        google      sales executive    masters                      0
3        google     business manager  bachelors                      1
4        google     business manager    masters                      1
5        google  computer programmer  bachelors                      0
6        google  computer programmer    masters                      1
7    abc pharma      sales executive    masters                      0
8    abc pharma  computer programmer  bachelors                      0
9    abc pharma     business manager  bachelors                      0
10   abc pharma     business manager    masters                      1
11     facebook      sales executive  bachelors                      1
12     facebook      sales executive    masters                      1
13     facebook     business manager  bachelors                      1
14     facebook     business manager    masters                      1
15     facebook  computer programmer  bachelors                      1
16     facebook  computer programmer    masters                      1

In [94]:
# Load the CSV file with custom headers
a=pd.read_csv('dataset/salaries.csv',header=None,names=['Income'])
a

                                                         Income
company    job                 degree     salary_more_then_100k
google     sales executive     bachelors                      0
                               masters                        0
           business manager    bachelors                      1
                               masters                        1
           computer programmer bachelors                      0
                               masters                        1
abc pharma sales executive     masters                        0
           computer programmer bachelors                      0
           business manager    bachelors                      0
                               masters                        1
facebook   sales executive     bachelors                      1
                               masters                        1
           business manager    bachelors                      1
                               masters                        1
           computer programmer bachelors                      1
                               masters                        1

In [115]:
#Load first 3 rows
a=pd.read_csv('dataset/salaries.csv',nrows=3)
a

  company               job     degree  salary_more_then_100k
0  google   sales executive  bachelors                      0
1  google   sales executive    masters                      0
2  google  business manager  bachelors                      1

In [121]:
# write data into a file
a=pd.read_csv('dataset/salaries.csv')
a.to_csv(r'dataset/test.csv',index=False)

In [123]:
# write particular columns into a file
a=pd.read_csv('dataset/salaries.csv')
a.to_csv(r'dataset/test1.csv',index=False,columns=['company','job'])

In [82]:
# read from excel
import pandas as pd
df=pd.read_excel(r'dataset/demo.xlsx','Sheet1')
print(df)

           day     city  temperature  windspeed          event
0        42736  newyork           32          6           Rain
1        42826  newyork           36          7          Sunny
2        42856  newyork           28         12           Snow
3        42887  newyork           33          7          Sunny
4        42917   mumbai           90          5          Sunny
5        42948   mumbai           85         12            Fog
6        42979   mumbai           87         15            Fog
7        43009   mumbai           92          5           Rain
8        43040    paris           45         20          Sunny
9        43070    paris           50         13         Cloudy
10  01-13-2017    paris           54          8  not available
11  01-14-2017    paris           42         10         Cloudy

In [114]:
# replace value with NaN
import pandas as pd
df=pd.read_excel(r'dataset/demo.xlsx',sheet_name='Sheet1',na_values=['n.a','not available'])
print(df)

           day     city  temperature  windspeed   event
0        42736  newyork           32          6    Rain
1        42826  newyork           36          7   Sunny
2        42856  newyork           28         12    Snow
3        42887  newyork           33          7   Sunny
4        42917   mumbai           90          5   Sunny
5        42948   mumbai           85         12     Fog
6        42979   mumbai           87         15     Fog
7        43009   mumbai           92          5    Rain
8        43040    paris           45         20   Sunny
9        43070    paris           50         13  Cloudy
10  01-13-2017    paris           54          8     NaN
11  01-14-2017    paris           42         10  Cloudy

In [116]:
# gave new header
import pandas as pd
df=pd.read_excel(r'dataset/demo.xlsx','Sheet1',header=None,names=['a','b','c'])
print(df)

                              a          b              c
day        city     temperature  windspeed          event
42736      newyork           32          6           Rain
42826      newyork           36          7          Sunny
42856      newyork           28         12           Snow
42887      newyork           33          7          Sunny
42917      mumbai            90          5          Sunny
42948      mumbai            85         12            Fog
42979      mumbai            87         15            Fog
43009      mumbai            92          5           Rain
43040      paris             45         20          Sunny
43070      paris             50         13         Cloudy
01-13-2017 paris             54          8  not available
01-14-2017 paris             42         10         Cloudy

In [100]:
# change values to null value(Nan)
import pandas as pd
df=pd.read_excel(r'dataset/demo.xlsx',sheet_name='Sheet1',na_values=['Rain'])
print(df)

           day     city  temperature  windspeed          event
0        42736  newyork           32          6            NaN
1        42826  newyork           36          7          Sunny
2        42856  newyork           28         12           Snow
3        42887  newyork           33          7          Sunny
4        42917   mumbai           90          5          Sunny
5        42948   mumbai           85         12            Fog
6        42979   mumbai           87         15            Fog
7        43009   mumbai           92          5            NaN
8        43040    paris           45         20          Sunny
9        43070    paris           50         13         Cloudy
10  01-13-2017    paris           54          8  not available
11  01-14-2017    paris           42         10         Cloudy

In [90]:
# copy/write to excel
a=df.to_excel(r'dataset/demo1.xlsx')
a

In [11]:
# read from excel
import pandas as pd
df=pd.read_excel(r'dataset/demo.xlsx','Sheet1',header=None)
print(df)

             0        1            2          3              4
0          day     city  temperature  windspeed          event
1        42736  newyork           32          6           Rain
2        42826  newyork           36          7          Sunny
3        42856  newyork           28         12           Snow
4        42887  newyork           33          7          Sunny
5        42917   mumbai           90          5          Sunny
6        42948   mumbai           85         12            Fog
7        42979   mumbai           87         15            Fog
8        43009   mumbai           92          5           Rain
9        43040    paris           45         20          Sunny
10       43070    paris           50         13         Cloudy
11  01-13-2017    paris           54          8  not available
12  01-14-2017    paris           42         10         Cloudy

In [49]:
import pandas as pd
df=pd.read_csv('dataset/test.txt')
print(df)

Empty DataFrame
Columns: [hello all]
Index: []

In [51]:
# converters method
def converted_people(name):
    if name=='larry page':
        return 'ben'
    else:
        return name
df1=pd.read_excel('dataset/stock_data.xlsx',converters={'people':converted_people})
df1

,Unnamed: 0.1,Unnamed: 0,tickers,eps,revenue,price,people
0,0,0,GOOGL,27.82,87,845,ben
1,1,1,WMT,4.61,484,65,n.a.
2,2,2,MSFT,-1,85,64,bill gates
3,3,3,RIL,not available,50,1023,mukesh ambani
4,4,4,TATA,-1,-1,n.a.,ratan tata

In [45]:
# save to excel
df1.to_excel('dataset/converted_data.xlsx', index=False)

In [53]:
# excel writer: used to right into single excel file & multiple sheets
with pd.ExcelWriter('dataset/stock_data_write_excel.xlsx') as wr:
    df.to_excel(wr,sheet_name='Sheet1',index=False)
    df1.to_excel(wr,sheet_name='Sheet2',index=False)